app/controllers/cats_controller.rb

	def edit
 		 @cat = Cats.find(params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", "1"]]

	def create
 	 @cat= Cats.new(cat_params)

 	 	if @cat.save
---
INSERT INTO "cats" ("category", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["category", "onemore"], ["created_at", Wed, 19 Aug 2015 11:01:25 UTC +00:00], ["title", "anotherone"], ["updated_at", Wed, 19 Aug 2015 11:01:25 UTC +00:00]]

	def destroy
   		@cat = Cats.find(params[:id])
    	@cat.destroy
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "cats" WHERE "cats"."id" = ?  [["id", 1]]

	def show
		@cats = Cats.find(params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", "2"]]

	def index
		@cats = Cats.all
---
SELECT "cats".* FROM "cats"