app/views/cats/show.html.erb

SELECT "rates".* FROM "rates" WHERE "rates"."cats_id" = ?  [[nil, 4]]
---
<h2>rates</h2>
<% @cats.rate.each do |rate| %>